Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ОбменМатериаламиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="9bc99607-c6e6-435f-9cd6-d09156ac3541">
  <name>ОбменМатериаламиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакетаДанных</name>
    <type>
      <types>EnumRef.ТипыПакетовДанныхСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПакетДляЭкспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеДоДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеПослеДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьТолькоПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИмпортированныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИмпортИзКаталогаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыДляЭкспорта</name>
    <attributes>
      <name>СсылкаНаЭлемент</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПакетыДанных</name>
    <attributes>
      <name>НомерПакетаДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПакетДанных</name>
      <type>
        <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Examinator/src/InformationRegisters/ИмпортированныеЭлементыПакетаSCORM/ИмпортированныеЭлементыПакетаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИмпортированныеЭлементыПакетаSCORM</name>
  <resources>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыПакетовДанныхСУЗ/ТипыПакетовДанныхСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПакетовДанныхСУЗ</name>
  <enumValues>
    <name>XML_V8</name>
  </enumValues>
  <enumValues>
    <name>SCORM_2004</name>
  </enumValues>
  <enumValues>
    <name>E4HOME</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/Forms/ФормаУзла/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Объект.Ссылка = УзелЭтойБазы Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	// Видимость закладок Экспорт, Импорт
	
	Элементы.СтраницаЭкспорт.Видимость  = Ложь;
	Элементы.СтраницаИмпорт.Видимость   = Ложь;
	
	Если Объект.ЭтоПакетДляЭкспорта Тогда
		Элементы.СтраницаЭкспорт.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ЭтоИмпортированныйПакет Тогда
		Элементы.СтраницаИмпорт.Видимость = Истина;
	КонецЕсли;
	
	// Видимость закладок импорта
	
	Если Объект.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.XML_V8") Тогда
		Элементы.SCORM.Видимость = Ложь;	
		Элементы.XML.Видимость   = Истина;
	ИначеЕсли Объект.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.SCORM_2004") Тогда
		Элементы.SCORM.Видимость = Истина;	
		Элементы.XML.Видимость   = Ложь;
	Иначе
		Элементы.SCORM.Видимость = Ложь;	
		Элементы.XML.Видимость   = Ложь;
	КонецЕсли;
	
	// Доступность формы
	
	Если Объект.ЭтоИмпортированныйПакет
		И НЕ Объект.ЭтоПакетДляЭкспорта Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	// Доступность настроек поставщика
	
	Если Объект.ЭкспортироватьПоследнююВерсию Тогда
		Элементы.ПредпочитатьПоставщика.Доступность   = Истина;
		Элементы.СохранитьПоследнююВерсию.Доступность = Истина;
	Иначе
		Элементы.ПредпочитатьПоставщика.Доступность   = Ложь;
		Элементы.СохранитьПоследнююВерсию.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипыЭлементовДляЭкспорта()
	
	Для каждого Элемент Из Объект.ЭлементыДляЭкспорта Цикл
		Если ЗначениеЗаполнено(Элемент.СсылкаНаЭлемент) Тогда
			Элемент.Тип = Строка(ТипЗнч(Элемент.СсылкаНаЭлемент));
		Иначе
			Элемент.Тип = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелЭтойБазы = ПланыОбмена.ОбменМатериаламиСУЗ.ЭтотУзел();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Код = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	// Получаем ИдентификаторИмпортированногоПакетаSCORM
	
	Если Объект.ЭтоИмпортированныйПакет И Объект.ТипПакетаДанных = Перечисления.ТипыПакетовДанныхСУЗ.SCORM_2004 Тогда
		
		НаборЗаписей = РегистрыСведений.ИмпортированныеЭлементыПакетаSCORM.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаЭлемент.Установить(Объект.Ссылка);

		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			ИдентификаторИмпортированногоПакетаSCORM = НаборЗаписей[0].ИдентификаторПакета;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
	УстановитьТипыЭлементовДляЭкспорта();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьПоследнююВерсиюПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЭлементовДляЭкспортаПриИзменении(Элемент)
	УстановитьТипыЭлементовДляЭкспорта();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЭлементыДляЭкспортаСсылкаНаЭлементОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(Элементы.ТаблицаЭлементовДляЭкспорта.ТекущиеДанные.СсылкаНаЭлемент);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
